In [1]:
print("hii")

hii

In [3]:
s= [1,12,13,15]
var= pd.Series(s)
print(var)

0     1
1    12
2    13
3    15
dtype: int64

In [4]:
print(var[0])

1

In [5]:
print(var[2])

13

In [6]:
a=[11,22,33,44]
var=pd.Series(a,index=["a","b","c","d"])
print(var)

a    11
b    22
c    33
d    44
dtype: int64

In [8]:
print(var["c"])

33

In [12]:
marks={"math":100, "science":200, "geography":300, "marathi":400, "history":250, "english":130}
var=pd.Series(marks)
print(var)

math         100
science      200
geography    300
marathi      400
history      250
english      130
dtype: int64

In [13]:
#calculate avg value
avg=var.mean()
print(f"Average marks is {avg}")

Average marks is 230.0

In [14]:
#calculate  total marks
sum= var.sum()
print(f"Total Marks Are: {sum}")

Total Marks Are: 1380

In [15]:
#calculate median of marks
median= var.median()
print(f"Median of marks is {median}")

Median of marks is 225.0

In [17]:
path="C:\Sample_python\sample_marks.csv"
data=pd.read_csv(path)
print(data)

     Subject  Marks
0       Math     95
1    Science     88
2  Geography     76
3    History     89
4    English     92

In [19]:
# Perform some basic operations
mean_marks = data["Marks"].mean()
sum_marks = data["Marks"].sum()
median_marks = data["Marks"].median()
max_marks = data["Marks"].max()
min_marks = data["Marks"].min()

In [20]:
# Display results of operations
print("\nBasic Operations:")
print(f"Mean Marks: {mean_marks}")
print(f"Sum of Marks: {sum_marks}")
print(f"Median Marks: {median_marks}")
print(f"Maximum Marks: {max_marks}")
print(f"Minimum Marks: {min_marks}")

Basic Operations:
Mean Marks: 88.0
Sum of Marks: 440
Median Marks: 89.0
Maximum Marks: 95
Minimum Marks: 76

In [25]:
print(data.loc[2])

Subject    Geography
Marks             76
Name: 2, dtype: object

In [26]:
print(data.loc[[0,1]])

   Subject  Marks
0     Math     95
1  Science     88

In [28]:
#df.to_string  is use for display entire dataset
print(data.to_string)

<bound method DataFrame.to_string of      Subject  Marks
0       Math     95
1    Science     88
2  Geography     76
3    History     89
4    English     92>

In [29]:
data.describe()

           Marks
count   5.000000
mean   88.000000
std     7.245688
min    76.000000
25%    88.000000
50%    89.000000
75%    92.000000
max    95.000000

In [30]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [25, 30, 35, 40, 29],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"],
    "Salary": [70000, 80000, 120000, 90000, 75000]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   40      Houston   90000
4      Eva   29      Phoenix   75000

In [31]:
# people earning > 80000
high_earners = df[df["Salary"] > 80000]
print("\nHigh Earners:")
print(high_earners)

High Earners:
      Name  Age     City  Salary
2  Charlie   35  Chicago  120000
3    David   40  Houston   90000

In [32]:
# Adding a new column Tax = 20% of Salary
df["Tax"] = df["Salary"] * 0.2
print("\nDataFrame with Tax Column:")
print(df)

DataFrame with Tax Column:
      Name  Age         City  Salary      Tax
0    Alice   25     New York   70000  14000.0
1      Bob   30  Los Angeles   80000  16000.0
2  Charlie   35      Chicago  120000  24000.0
3    David   40      Houston   90000  18000.0
4      Eva   29      Phoenix   75000  15000.0

In [34]:
# Sorting by Salary
sorted_df = df.sort_values(by="Salary", ascending=False)
print("\nSorted by Salary:")
print(sorted_df)

# sorting salary in desc order

Sorted by Salary:
      Name  Age         City  Salary      Tax
2  Charlie   35      Chicago  120000  24000.0
3    David   40      Houston   90000  18000.0
1      Bob   30  Los Angeles   80000  16000.0
4      Eva   29      Phoenix   75000  15000.0
0    Alice   25     New York   70000  14000.0

In [37]:
# Grouping by City and calculating mean Salary
grouped = df.groupby("City")["Salary"].mean()
print("\nMean Salary by City:")
print(grouped)

Mean Salary by City:
City
Chicago        120000.0
Houston         90000.0
Los Angeles     80000.0
New York        70000.0
Phoenix         75000.0
Name: Salary, dtype: float64

In [ ]:
print("hii")